<template>
  <div class="bg-container">
    <div class="cprotocol-container">
      <div class="header">
        <p class="header-title">斗西家计划 <span></span> 服务协议</p>
      </div>
      <div class="content">
        <p class="content-title">
          《斗西家计划服务使用协议》
        </p>
        <div class="content-list">
          <div class="item">
            <p class="item-title">
              第一条【完全了解】
            </p>
            <div class="item-content">
              <p class="content-text">
                请您（以下亦称“用户”）仔细阅读本协议全部条款，并确认您已完全了解本协议之规定。未成年人应当在监护人陪同和指导下阅读本协议，并在使用本协议项下服务前取得监护人的同意。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束，本协议将构成您与XXXX有限公司及其关联方（以下简称“斗西家计划”）之间关于您使用斗西家计划开发及运营的斗西家计划网站和软件应用（以下简称“’斗西家计划’产品”）有约束力的法律文件。本协议内容包括本协议正文及“斗西家计划”通过“斗西家计划”产品已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第二条【充分授权】
            </p>
            <div class="item-content">
              <p class="content-text">
                您确认您依照中国法律法规及您所在地之法律及您自愿或应当接收其管辖之法律，有权签署并同意接受本协议的约束。如果您代表您的雇主或单位，您确认并保证您已获得签署本协议的充分授权。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第三条 【协议变更】
            </p>
            <div class="item-content">
              <p class="content-text">
                本协议（包括任何规则）如果变更，“斗西家计划”将尽可能提前在“斗西家计划”产品中发布通知。但您应了解并同意，“斗西家计划”有可能未经事先通知，而修改或变更本协议的全部或部分内容，您也应随时关注本协议是否有修改或变更之情形。
                如果本协议修改或变更，而您不能接受修改或变更后的内容，您应立即停止使用“斗西家计划”相关产品和服务。如果您继续使用“斗西家计划”相关产品和服务，则表明您完全接受并愿意遵守修改或变更后的本协议。
                无论您停止使用或继续使用“斗西家计划”相关产品和服务，您都承诺不因本协议修改或变更而向“斗西家计划”要求赔偿或补偿或提出其他权利主张。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第四条 【服务方式】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”是网络服务提供者，可针对不同传播渠道用户为其提供内容服务，前述传播渠道包括但不限于：
              </p>
              <p class="content-text_br">
                <span>1.</span>通过“斗西家计划”的产品及服务；
              </p>
              <p class="content-text_br">
                <span>2.</span
                >“斗西家计划”提供的可以使用的其他传播渠道。除免费服务外，“斗西家计划”可能提供部分收费服务。您可以通过付费方式购买收费服务，具体方式为：通过网上银行或“斗西家计划”产品内提供的其他付费途径支付一定数额的人民币，从而获得收费服务使用权限。对于收费服务，“斗西家计划”会在您使用之前给予明确的提示，只有根据提示确认同意按照前述支付方式支付费用并完成了支付行为，才能使用该等收费服务。支付行为的完成以银行或第三方支付平台生成“支付已完成”的确认通知为准。您应了解“斗西家计划”相关产品和服务可能对该等服务（含收费服务）进行更改、更新或升级，您同意不因“斗西家计划”更改、更新或升级其服务而向“斗西家计划”要求赔偿或补偿或提出其他权利主张。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第五条【善意使用】
            </p>
            <div class="item-content">
              <p class="content-text">
                您同意，遵守法律及本协议规定，秉承善意使用“斗西家计划”相关产品及服务，且保证：
              </p>
              <p class="content-text_br">
                <span>1.</span>
                不会利用“斗西家计划”相关产品或服务进行非法活动、或进行可能侵犯他人权利或损害他人利益的活动；不会以非法方式获取或利用“斗西家计划”产品及服务其他用户的信息。
              </p>
              <p class="content-text_br">
                <span>2.</span>
                不会以技术方式攻击或破坏或改变“斗西家计划”产品及服务的部分或全部、或干扰其运行；不会以非法方式获取或使用“斗西家计划”产品及服务的任何软件、代码、内容或其他技术或商业信息；不会对“斗西家计划”产品及服务运行的任何程序进行反向工程、反向编译、反向汇编或改写。
              </p>
              <p class="content-text_br">
                <span>3.</span>
                不会未经许可使用“斗西家计划”的网站名称、公司名称、商标、商业标识、网页版式或内容、或其他由“斗西家计划”享有知识产权或权利的信息或资料；不会侵犯“斗西家计划”的商标权、著作权、专利权、技术秘密、其他知识产权或其他合法权利或权益。不会以任何方式贬损“斗西家计划”的商业声誉。
              </p>
              <p class="content-text_br">
                <span>4.</span>
                不会利用“斗西家计划”进行其他违背公序良俗的活动。您使用“斗西家计划”产品及服务的记录，可能被保存作为对您不利的证据。“斗西家计划”也可能将您违反法律或侵犯第三方权利或权益的记录报告给行政主管部门、司法机关。您理解并保证您在“斗西家计划”产品中上传、发布或传输的信息、内容（包括您的账户名称等信息）应当遵守宪法、法律和行政法规，不得含有以下内容，否则，“斗西家计划”将立即停止传输该信息，采取消除等处置措施，防止信息扩散，保存有关记录，并向有关主管部门报告：
              </p>
              <div class="content-text_appoint">
                <p class="appoint-item_br">
                  <span class="appoint">1.</span>反对宪法确定的基本原则的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">2.</span
                  >危害国家统一、主权和领土完整的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">3.</span
                  >泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">4.</span
                  >煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">5.</span>宣扬邪教、迷信的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">6.</span>扰乱社会秩序，破坏社会稳定的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">7.</span
                  >诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">8.</span
                  >侮辱或者诽谤他人，侵害公民个人名誉、隐私、知识产权和其他合法权益的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">9.</span
                  >危害社会公德，损害民族优秀文化传统的；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">10.</span
                  >有关法律、行政法规和国家规定禁止的其他内容。如果您上传、发布或传输的信息、内容含有以上违反法律法规的信息或内容，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给“斗西家计划”造成不利后果的，您应负责消除影响，并且赔偿“斗西家计划”因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。
                </p>
              </div>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第六条 【注册账号】
            </p>
            <div class="item-content">
              <p class="content-text">
                您需要在“斗西家计划”产品中注册一个账号，并按照“斗西家计划”产品公示的要求进行账号设置，才可以使用该账号登录并使用“斗西家计划”相关产品和服务。您可依照“斗西家计划”产品公示的规则修改您的账号密码，但不可修改账号。
                您注册账号时，应按照“斗西家计划”产品公示的提示及要求填写或提供资料、信息，并确保用户身份及信息的真实性、正确性及完整性；如果资料发生变化，您应及时更改。您同意并承诺：
              </p>
              <p class="content-text_br">
                <span>1.</span>不故意冒用他人信息为您注册帐号；
              </p>
              <p class="content-text_br">
                <span>2.</span>不未经他人合法授权以他人名义注册帐号；
              </p>
              <p class="content-text_br">
                <span>3.</span
                >不使用色情、暴力或侮辱、诽谤他人等违反公序良俗的词语注册帐号。如您违反前述规定，“斗西家计划”有权随时拒绝您使用该账号，或者限制您使用，或者注销该账号。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第七条 【账号使用】
            </p>
            <div class="item-content">
              <p class="content-text">
                在您完成账号注册后，“斗西家计划”将向您提供帐号及初始登录方式，此后，您应自行保管及维持密码及帐号的安全。您应自行使用该账号，并对该账号项下发生的一切行为及活动负完全的责任。您应了解，在账号和密码匹配时，“斗西家计划”无法对非法或未经您授权使用您帐号及密码的行为作出甄别，因此，“斗西家计划”对任何使用您账号和密码登录并使用“斗西家计划”产品及服务的行为不承担任何责任。
                您同意并承诺：
              </p>
              <p class="content-text_br">
                <span>1.</span>
                当您的帐号或密码遭到未获授权的使用，或者发生其他任何安全问题时，您会立即有效通知到“斗西家计划”；
              </p>
              <p class="content-text_br">
                <span>2.</span>
                当您每次上网或使用其他服务完毕后，会将有关帐号等安全退出。“斗西家计划”有权根据自己的判定，在怀疑账号被不当使用时，拒绝账号使用或限制账号使用或注销该账号。您知悉并同意，您仅得依据本协议享有对“斗西家计划”产品账户及相关功能、服务的使用权，您仅能为自身学习、技术交流等非营利性目的使用账户及功能、服务；您不得出于任何非法或未经“斗西家计划”授权的目的使用账户或“斗西家计划”产品提供的功能、服务，包括但不限于，不得恶意注册帐号（无论是否以营利为目的），不得利用账户或“斗西家计划”产品提供的功能、服务从事营利活动，不得以营利或非营利目的以任何方式（包括但不限于转让、借用、出租、共享等）向任何第三方提供账户使用权或“斗西家计划”产品提供的功能、服务或其任何部分，不得利用账户或“斗西家计划”产品提供的功能、服务从事任何违法或侵犯第三方知识产权或其他合法权益的活动。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第八条 【个人信息及隐私条款】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”可能需要搜集能识别用户身份的个人信息以便可以在必要时联系用户，或为用户提供更好的使用体验。“个人信息”包括但不限于用户的姓名、性别、年龄、出生日期、联系电话、身份证号、地址、受教育情况、公司情况、所属行业、兴趣爱好、所处位置信息、个人说明、手机软硬件信、手机识别码等。“斗西家计划”承诺，不以非法方式披露您依照“斗西家计划”规定的方式标明应予保密的用户个人信息。您了解并同意，“斗西家计划”可依照法律或司法、行政机关的强制性命令披露您的个人信息且无需事先向您发出通知。您了解并同意，当您在“斗西家计划”产品中购买第三方商品或服务时，您的信息将被提供给该等商品或服务的提供方，以便其向您提供产品或服务，您与该等第三方商品或服务提供方之间的隐私保护事项由您与该等第三方商品或服务提供方自行解决，“斗西家计划”不因向该等第三方商品或服务提供方提供您的个人信息而向您承担任何责任。您了解并同意，除为提供或改进“斗西家计划”产品及服务合理所需以外，“斗西家计划”在下述情形下可利用您的个人信息：
              </p>
              <p class="content-text_br">
                <span>1.</span>在紧急情况下，为维护用户及公众的权益。
              </p>
              <p class="content-text_br">
                <span>2.</span>
                为维护“斗西家计划”的著作权、商标权、专利权及其他任何合法权利或权益。
              </p>
              <p class="content-text_br">
                <span>3.</span>
                在进行促销或抽奖时，“斗西家计划”可能会与赞助商共享用户的个人信息，在这些情况下“斗西家计划”会在发送用户信息之前进行提示，并且用户可以通过明确表示不参与活动而终止传送过程。
              </p>
              <p class="content-text_br">
                <span>4.</span> 为获取第三方数据而将用户信息与第三方数据匹配。
              </p>
              <p class="content-text_br">
                <span>5.</span>
                将用户数据用于统计，以便向未来的合作伙伴、广告商及其他第三方以及为了其他合法目的而描述“斗西家计划”的服务。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第九条 【知识产权】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”对“斗西家计划”相关产品和服务及“斗西家计划”所使用的软件所包含的受知识产权法或其他法律保护的对象享有相应的权利。“斗西家计划”产品和服务的整体内容及其任何部分（包括但不仅限于网站设计、程序、代码、设计图样以及其他图样、产品及服务名称）的版权、商标权及其他知识产权归“斗西家计划”享有，任何人不得使用、复制或用作其他用途。
                经由“斗西家计划”产品和服务传送的文字、图片、音频、视频及其他内容，受到著作权法、商标法、专利法或其他法律的保护；未经相关权利人书面授权许可，您不得自行或许可第三方进行使用、修改、出租、售卖、传播、衍生其他作品或进行任何其他使用或处分。“斗西家计划”对其专有内容、原创内容和其他通过授权取得的内容享有知识产权或相应权利。未经“斗西家计划”书面许可，任何单位和个人不得私自转载、传播和提供收听服务或者实施任何其他侵犯“斗西家计划”知识产权的行为，否则，“斗西家计划”将依法追究相关法律责任。为了促进知识的分享和传播，您同意将在“斗西家计划”产品上发表的全部内容（包括但不仅限于留言、评论和笔记），授予“斗西家计划”免费的、不可撤销的、非独家使用许可权，“斗西家计划”有权将该内容用于“斗西家计划”各种形态的产品和服务上，包括但不限于“斗西家计划”已经或未来发布的应用或其他互联网产品。您在“斗西家计划”产品上传或发表的内容，应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，“斗西家计划”有权根据实际情况删除相关的内容，且有权追究用户的法律责任，因此给“斗西家计划”或任何第三方造成损失的，用户应负责全额赔偿。“斗西家计划”有权对您发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及“斗西家计划”公开的原则对侵权信息进行处理。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十条 【链接】
            </p>
            <div class="item-content">
              <p class="content-text">
                为方便您使用，“斗西家计划”可能会提供第三方国际互联网网站或资源链接。您应了解，除非另有声明，“斗西家计划”无法对第三方网站服务进行控制。您因下载或传播或使用或依赖上述网站或资源所生的损失或损害，应由您与第三方网站或相关责任方解决或处理，“斗西家计划”不承担任何责任。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十一条 【有限责任及免责条款】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”按照“斗西家计划”产品及服务的“现状”向用户提供产品及服务，“斗西家计划”不对“斗西家计划”产品及/或其功能、服务作出任何其他明示或暗示的保证。用户在“斗西家计划”上进行的任何行为均是用户的个人行为，由于信息的海量性，“斗西家计划”无法对信息或内容的权属、合法性、合规性、真实性、科学性、完整权、有效性等进行审查。因用户行为或用户上传、存储、发布、传播的任何信息、内容等引发的任何争议、责任，或由此产生的任何直接、间接、偶然、特殊的损害，均由用户自行承担法律责任，“斗西家计划”不承担任何责任；如用户行为对“斗西家计划”造成损失或不良影响，“斗西家计划”保留追究相关用户法律责任的权利。“斗西家计划”对用户所发布信息的删除或储存失败不承担任何法律责任。不论在何种情况下，“斗西家计划”均不对由于Internet连接故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令，黑客攻击，互联网病毒，网络运营商技术调整，政府临时管制或任何其他“斗西家计划”不能合理控制的原因而造成的“斗西家计划”产品不能访问、产品及服务中断、信息及数据的延误、停滞或错误，不能提供或延迟提供服务而承担责任。不论是否可以预见，不论是源于何种形式的行为或不作为，“斗西家计划”不对因任何原因造成的任何特别的、间接的、惩罚性的、突发性的或其他任何损害（包括但不限于利润或其他可得利益的损失）承担责任。除“斗西家计划”因故意或重大过失损害用户的利益以外，任何情况下，“斗西家计划”向用户承担的赔偿、补偿或其他任何责任的限额将不超过该等用户就相关服务向“斗西家计划”支付的服务费用的数额。基于互联网的开放性属性，用户知悉用户将信息、内容等上传到互联网上，可能会被其他组织或个人复制、转载、修改或进行其他使用（包括用于非法用途），用户必须充分意识到此类风险的存在。用户同意使用“斗西家计划”产品过程中所存在的上述风险将完全由用户自行承担，“斗西家计划”对此不承担任何责任。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十二条 【“斗西家计划”的商业活动】
            </p>
            <div class="item-content">
              <p class="content-text">
                您了解并接受，“斗西家计划”为维护其运营所经营，可能进行下述商业活动：
              </p>
              <p class="content-text_br">
                <span>1.</span>
                通过电子邮件、客户端、网页或其他合法方式向用户发送商品促销或其他相关商业信息。
              </p>
              <p class="content-text_br">
                <span>2.</span>
                通过增值服务系统或其他方式向用户发送的相关服务信息或其他信息，其他信息包括但不限于通知信息、宣传信息、广告信息等。如您不同意收取此类信息，您可以选择退订相关信息。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十三条 【非商业使用】
            </p>
            <div class="item-content">
              <p class="content-text">
                您同意，仅以非商业目的使用“斗西家计划”产品和服务；不对“斗西家计划”产品和服务的任何部分或全部进行商业性质利用、复制、拷贝、出售、调查、广告，或将“斗西家计划”产品和服务用于其他任何商业目的或商业性质的活动；但“斗西家计划”与您另行签订有协议或“斗西家计划”另行指定可供您使用的特定商业服务除外。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十四条 【网络运行】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”尽可能保证其产品和服务的稳定运行。您应理解并同意，因法律、政策、技术、经济、管理的原因，除非您和“斗西家计划”另有约定，“斗西家计划”不会因以下情形出现而对您承担责任：
              </p>
              <p class="content-text_br">
                <span>1.</span>
                “斗西家计划”产品或服务无法使用或中断使用或无法完全适合用户的使用要求。
              </p>
              <p class="content-text_br">
                <span>2.</span>
                “斗西家计划”产品或服务受到干扰，无法及时、安全、可靠运行，或出现任何错误。
              </p>
              <p class="content-text_br">
                <span>3.</span>
                经由“斗西家计划”产品或服务取得的任何产品、服务（含收费服务）或其他材料不符合您的期望。
              </p>
              <p class="content-text_br">
                <span>4.</span>
                非因“斗西家计划”的故意或重大过失，用户资料遭到未经授权的使用或修改。“斗西家计划”不对您在本协议项下服务中相关数据的删除或储存失败负责。“斗西家计划”可以根据实际情况自行决定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。如您停止使用“斗西家计划”产品，或“斗西家计划”所提供的产品或服务终止或中止，“斗西家计划”可以从服务器上永久地删除用户的数据。“斗西家计划”没有义务向用户返还任何数据。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十五条 【服务终止】
            </p>
            <div class="item-content">
              <p class="content-text">
                本协议或本协议项下“斗西家计划”所提供的产品使用及服务（含收费服务）可在下述情形下部分或全部中止或终止：
              </p>
              <p class="content-text_br">
                <span>1.</span
                >因法律规定，或“斗西家计划”服从行政命令或司法判令的要求。
              </p>
              <p class="content-text_br"><span>2.</span>用户违反本协议。</p>
              <p class="content-text_br">
                <span>3.</span
                >“斗西家计划”认为应予终止的其他情形。在一般情形下，“斗西家计划”会提前按照您提供的联系方式以电子邮件或短信或其他电子方式通知您产品使用及服务将中止或终止。您应了解并同意，在紧急情况或特殊下，“斗西家计划”可不经通知即中止或终止产品使用及服务。在本协议或本协议项下“斗西家计划”提供的产品使用及服务（含收费服务）中止或终止时，“斗西家计划”有权：
              </p>
              <div class="content-text_appoint">
                <p class="appoint-item_br">
                  <span class="appoint">1.</span> 拒绝用户登录“斗西家计划”
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">2.</span> 删除用户信息；
                </p>
                <p class="appoint-item_br">
                  <span class="appoint">3.</span
                  >删除用户购买的内容。您同意，如因“斗西家计划”原因导致付费产品在到期前终止使用，“斗西家计划”仅需按照相关产品规则向您返还未到期部分对应的价款，“斗西家计划”无需承担其他责任或义务，且除上述情形外，“斗西家计划”无需因本协议或本协议项下“斗西家计划”所提供的产品使用及服务中止或终止，而向您作出赔偿或补偿或承担任何其他责任。
                </p>
              </div>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十六条 【法律适用】
            </p>
            <div class="item-content">
              <p class="content-text">
                您在使用“斗西家计划”产品及服务时，应遵守中华人民共和国法律、及您所在地之法律、及您自愿或应当接收其管辖之法律。本协议的解释及履行应按照中华人民共和国（为本协议之目的，不包括港澳台地区）法律进行。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十七条 【法律责任】
            </p>
            <div class="item-content">
              <p class="content-text">
                您应就所上传的内容承担全部法律责任；无论前述责任是因侵犯第三方权利所引起的、或因您违反与第三方或本协议引起的、或因您违反法律引起的；前述责任包括对“斗西家计划”或第三方所承担的民事责任、或行政机关要求承担的行政责任或刑事责任。您同意，如因您违反法律规定或本协议规定给“斗西家计划”造成损失，您将充分赔偿“斗西家计划”所遭受的损失、包括其直接损失、间接损失、预期利益损失等一切损失。您确认，如因第三方向您主张权利而导致您承担责任，或您承担行政责任或刑事责任的，“斗西家计划”无需向您承担任何责任。如您应向“斗西家计划”承担责任，前述责任不因本协议或本协议项下的服务被终止而免除。
                如您在使用“斗西家计划”产品及服务的过程中发生任何违反法律法规或本协议的行为，“斗西家计划”有权根据行为过错、性质、后果等采取相应措施，包括但不限于删除相关内容、暂停账户使用、解除本协议、终止产品使用及服务、追索赔偿等，由此造成的一切风险、损失及责任将由您自行承担。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十八条 【相关协议】
            </p>
            <div class="item-content">
              <p class="content-text">
                “斗西家计划”可能不时发布针对用户的相关协议或规则，该等相关协议或规则作为对本协议的补充或修改而成为本协议的一部分。请您及时关注并阅读相关协议或规则。
              </p>
            </div>
          </div>
          <div class="item">
            <p class="item-title">
              第十九条 【争议解决】
            </p>
            <div class="item-content">
              <p class="content-text">
                您和“斗西家计划”均同意，因本协议解释或执行引起的任何争议，双方应首先友好协商解决。协商不成时，争议将提交“斗西家计划”所在地法院诉讼解决。请您再次确认您已全部阅读并充分理解上述协议。如有任何问题，可通过客服邮箱【XXXX】与“斗西家计划”取得联系。
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<style lang="less" scoped>
.bg-container {
  background-color: #e1eced;
}
.cprotocol-container {
  width: 800px;
  margin: 0 auto;
  padding-bottom: 30px;
  .header {
    display: flex;
    border-bottom: 1px solid #999;
    .header-title {
      font-size: 20px;
      line-height: 60px;
      font-weight: 500;
      color: #333;
      position: relative;
      span {
        display: inline-block;
        width: 2px;
        height: 30px;
        background-color: #999;
        transform: translateY(25%);
        margin: 0 10px;
      }
    }
  }
  .content {
    .content-title {
      color: #333;
      text-align: center;
      font-size: 26px;
      font-weight: 500;
      line-height: 100px;
    }
    .content-list {
      .item {
        margin-bottom: 20px;
        .item-title {
          color: #333;
          font-size: 24px;
          font-weight: 500;
          line-height: 30px;
          margin-bottom: 20px;
        }
        .item-content {
          font-size: 16px;
          color: #666;
          line-height: 30px;
          .content-text {
            text-indent: 25px;
            color: #333;
            font-weight: 500;
          }
          .content-text_br {
            display: block;
            margin: 10px 0;
            text-indent: 20px;
            color: #545454;
            font-weight: 400;
            span {
              color: #333;
              font-weight: 600;
              margin-right: 10px;
            }
          }
          .content-text_appoint {
            margin-left: 35px;
            span {
              display: inline-block;
              color: #333;
              font-weight: 600;
              margin-right: 10px;
            }
          }
        }
      }
    }
  }
}
</style>
